### Forest: Snapshot Service Infrastructure Plan: success

<details><summary>Show Plan</summary>

```
module.daily_snapshot.data.external.sources_tar: Reading...
module.daily_snapshot.data.local_file.init: Reading...
module.daily_snapshot.data.local_file.init: Read complete after 0s [id=ac10e30d94c7175667d0f167d737c2ed514cbd75]
module.daily_snapshot.data.external.sources_tar: Read complete after 0s [id=-]
module.daily_snapshot.data.local_file.sources: Reading...
module.daily_snapshot.data.digitalocean_ssh_keys.keys: Reading...
module.daily_snapshot.digitalocean_volume.forest_storage: Refreshing state... [id=778996de-2a13-11ee-a34c-0a58ac14d315]
module.daily_snapshot.data.digitalocean_project.forest_project: Reading...
module.daily_snapshot.data.local_file.sources: Read complete after 0s [id=8ee9290ec4ee54c5e5e461ab632414fe475deb80]
module.daily_snapshot.data.digitalocean_ssh_keys.keys: Read complete after 0s [id=ssh_keys/4003270040538543685]
module.daily_snapshot.data.digitalocean_project.forest_project: Read complete after 2s [id=da5e6601-7fd9-4d02-951e-390f7feb3411]
module.daily_snapshot.digitalocean_droplet.forest: Refreshing state... [id=367017201]
module.daily_snapshot.digitalocean_project_resources.connect_forest_project: Refreshing state... [id=da5e6601-7fd9-4d02-951e-390f7feb3411]
module.daily_snapshot.digitalocean_firewall.forest-firewall: Refreshing state... [id=faaa9b8c-c3eb-4d2e-8ba5-ac1edfd6debb]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.daily_snapshot.digitalocean_droplet.forest must be replaced
-/+ resource "digitalocean_droplet" "forest" {
      ~ created_at           = "2023-07-26T07:51:02Z" -> (known after apply)
      ~ disk                 = 300 -> (known after apply)
      ~ id                   = "367017201" -> (known after apply)
      ~ ipv4_address         = "164.90.163.26" -> (known after apply)
      ~ ipv4_address_private = "10.135.0.7" -> (known after apply)
      + ipv6_address         = (known after apply)
      ~ locked               = false -> (known after apply)
      ~ memory               = 16384 -> (known after apply)
        name                 = "forest-snapshot"
      ~ price_hourly         = 0.19494 -> (known after apply)
      ~ price_monthly        = 131 -> (known after apply)
      ~ private_networking   = true -> (known after apply)
      ~ status               = "active" -> (known after apply)
        tags                 = [
            "iac",
        ]
      ~ urn                  = "do:droplet:367017201" -> (known after apply)
      ~ user_data            = "881527521a0dfe62b2d2928e7c8721cd245150c3" -> "b1736bb8bdefb541c56ca53cc1f78370013bd3ee" # forces replacement
      ~ vcpus                = 2 -> (known after apply)
      ~ vpc_uuid             = "46a525ac-fd37-47ea-bb10-95c1db0055f7" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.daily_snapshot.digitalocean_firewall.forest-firewall will be updated in-place
  ~ resource "digitalocean_firewall" "forest-firewall" {
      ~ droplet_ids     = [
          - 367017201,
        ] -> (known after apply)
        id              = "faaa9b8c-c3eb-4d2e-8ba5-ac1edfd6debb"
        name            = "forest-snapshot"
        tags            = []
        # (3 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.daily_snapshot.digitalocean_project_resources.connect_forest_project will be updated in-place
  ~ resource "digitalocean_project_resources" "connect_forest_project" {
        id        = "da5e6601-7fd9-4d02-951e-390f7feb3411"
      ~ resources = [
          - "do:droplet:367017201",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

Changes to Outputs:
  ~ ip = [
      - [
          - "164.90.163.26",
        ],
      + [
          + (known after apply),
        ],
    ]

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>